MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NANO100SE3BN/mcu.h
    /**
     * PB_H_MFP
     * ===================================================================================================
     * Offset: 0x3C  Port B high byte multiple function control register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PB8_MFP   |PB.8 Pin Function Selection
     * |        |          |001 = ADC external trigger
     * |        |          |010 = Timer0 external event input or Timer0 toggle output
     * |        |          |011 = External interrupt 0
     * |        |          |100 = SmartCard 2 power
     * |        |          |111 = LCD SEG 30
     * |        |          |Others = GPIOB[8]
     * |[6:4]   |PB9_MFP   |PB.9 Pin Function Selection
     * |        |          |001 = SPI1 2nd slave select pin
     * |        |          |010 = Timer1 external event input or Timer1 toggle output
     * |        |          |100 = SmartCard 2 RST
     * |        |          |101 = External interrupt 0
     * |        |          |111 = LCD V1
     * |        |          |Others = GPIOB[9]
     * |[10:8]  |PB10_MFP  |PB.10 Pin Function Selection
     * |        |          |001 = SPI0 2nd slave select pin
     * |        |          |010 = Timer2 external event input or Timer2 toggle output
     * |        |          |100 = SmartCard 2 clock
     * |        |          |101 = SPI0 MOSI0
     * |        |          |111 = LCD V2
     * |        |          |Others = GPIOB[10]
     * |[14:12] |PB11_MFP  |PB.11 Pin Function Selection
     * |        |          |001 = PWM1 Channel 0
     * |        |          |010 = Timer3 external event input or Timer3 toggle output
     * |        |          |100 = SmartCard 2 DATA
     * |        |          |101 = SPI0 MISO0
     * |        |          |111 = LCD V3
     * |        |          |Others = GPIOB[11]
     * |[18:16] |PB12_MFP  |PB.12 Pin Function Selection
     * |        |          |010 = EBI AD[0]
     * |        |          |100 = FRQDIV_CLK
     * |        |          |111 = LCD SEG 24
     * |        |          |Others = GPIOB[12]
     * |[22:20] |PB13_MFP  |PB.13 Pin Function Selection
     * |        |          |010 = EBI AD[1]
     * |        |          |111 = LCD SEG 25
     * |        |          |Others = GPIOB[13]
     * |[26:24] |PB14_MFP  |PB.14 Pin Function Selection
     * |        |          |001 = External interrupt 0
     * |        |          |011 = SmartCard 2 card detect
     * |        |          |100 = SPI2 2nd slave select pin
     * |        |          |111 = LCD SEG 26
     * |        |          |Others = GPIOB[14]
     * |[30:28] |PB15_MFP  |PB.15 Pin Function Selection
     * |        |          |001 = External interrupt 1
     * |        |          |011 = Snooper pin
     * |        |          |100 = SmartCard1 card detect
     * |        |          |111 = LCD SEG 31
     * |        |          |Others = GPIOB[15]
    */
    __IO uint32_t PB_H_MFP;

    /**
     * PC_L_MFP
     * ===================================================================================================
     * Offset: 0x40  Port C low byte multiple function control register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PC0_MFP   |PC.0 Pin Function Selection
     * |        |          |001 = SPI0 1st slave select pin
     * |        |          |010 = I2S WS
     * |        |          |100 = SmartCard1 clock
     * |        |          |111 = LCD DH1
     * |        |          |Others = GPIOC[0]
     * |[6:4]   |PC1_MFP   |PC.1 Pin Function Selection
     * |        |          |001 = SPI0 SCLK
     * |        |          |010 = I2S BCLK
     * |        |          |100 = SmartCard1 DATA
     * |        |          |111 = LCD DH2
     * |        |          |Others = GPIOC[1]
     * |[10:8]  |PC2_MFP   |PC.2 Pin Function Selection
     * |        |          |001 = SPI0 MISO0
     * |        |          |010 = I2S Din
     * |        |          |100 = SmartCard1 Power
     * |        |          |111 = LCD COM 0
     * |        |          |Others = GPIOC[2]
     * |[14:12] |PC3_MFP   |PC.3 Pin Function Selection
     * |        |          |001 = SPI0 MOSI1
     * |        |          |010 = I2S Dout
     * |        |          |100 = SmartCard1 RST
     * |        |          |111 = LCD COM 1
     * |        |          |Others = GPIOC[3]
     * |[18:16] |PC4_MFP   |PC.4 Pin Function Selection
     * |        |          |001 = SPI0 MISO1
     * |        |          |111 = LCD COM 2
     * |        |          |Others = GPIOC[4]
     * |[22:20] |PC5_MFP   |PC.5 Pin Function Selection
     * |        |          |001 = SPI0 MOSI1
     * |        |          |111 = LCD COM 3
     * |        |          |Others = GPIOC[5]
     * |[26:24] |PC6_MFP   |PC.6 Pin Function Selection
     * |        |          |001 = DA out0
     * |        |          |010 = EBI AD[4]
     * |        |          |011 = Timer0 capture event
     * |        |          |100 = SmartCard1 card detection
     * |        |          |101 = PWM0 Channel 0
     * |        |          |Others = GPIOC[6]
     * |[30:28] |PC7_MFP   |PC.7 Pin Function Selection
     * |        |          |001 = DA out1
     * |        |          |010 = EBI AD[5]
     * |        |          |011 = Timer1 capture event
     * |        |          |101 = PWM0 Channel 1
     * |        |          |Others = GPIOC[7]
    */
    __IO uint32_t PC_L_MFP;

    /**
     * PC_H_MFP
     * ===================================================================================================
     * Offset: 0x44  Port C high byte multiple function control register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PC8_MFP   |PC.8 Pin Function Selection
     * |        |          |001 = SPI1 1st slave select pin
     * |        |          |010 = EBI MCLK
     * |        |          |101 = I2C1 SDA
     * |        |          |Others = GPIOC[8]
     * |[6:4]   |PC9_MFP   |PC.9 Pin Function Selection
     * |        |          |001 = SPI1 SCLK
     * |        |          |101 = I2C1 SCL
     * |        |          |Others = GPIOC[9]
     * |[10:8]  |PC10_MFP  |PC.10 Pin Function Selection
     * |        |          |001 = SPI1 MISO0
     * |        |          |101 = UART1 RX
     * |        |          |Others = GPIOC[10]
     * |[14:12] |PC11_MFP  |PC.11 Pin Function Selection
     * |        |          |001 = SPI1 MOSI0
     * |        |          |101 = UART1 TX
     * |        |          |Others = GPIOC[11]
     * |[18:16] |PC12_MFP  |PC.12 Pin Function Selection
     * |        |          |001 = SPI1 MISO1
     * |        |          |010 = PWM1 Channel 0
     * |        |          |101 = External interrupt 0
     * |        |          |110 = I2C0 SDA
     * |        |          |Others = GPIOC[12]
     * |[22:20] |PC13_MFP  |PC.13 Pin Function Selection
     * |        |          |001 = SPI1 MOSI1
     * |        |          |010 = PWM1 Channel 1
     * |        |          |100 = Snooper pin
     * |        |          |101 = External interrupt 1
     * |        |          |110 = I2C0 SCL
     * |        |          |Others = GPIOC[13]
     * |[26:24] |PC14_MFP  |PC.14 Pin Function Selection
     * |        |          |010 = EBI AD[2]
     * |        |          |100 = PWM1 Channel 3
     * |        |          |111 = LCD SEG 32
     * |        |          |Others = GPIOC[14]
     * |[30:28] |PC15_MFP  |PC.15 Pin Function Selection
     * |        |          |010 = EBI AD[3]
     * |        |          |011 = Timer0 capture event
     * |        |          |100 = PWM1 Channel 2
     * |        |          |111 = LCD SEG 33
     * |        |          |Others = GPIOC[15]
    */
    __IO uint32_t PC_H_MFP;

    /**
     * PD_L_MFP
     * ===================================================================================================
     * Offset: 0x48  Port D low byte multiple function control register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PD0_MFP   |PD.0 Pin Function Selection
     * |        |          |001 = UART1 RX
     * |        |          |011 = SPI2 1st slave select pin
     * |        |          |100 = SmartCard1 clock
     * |        |          |101 = ADC input channel8
     * |        |          |Others = GPIOD[0]
     * |[6:4]   |PD1_MFP   |PD.1 Pin Function Selection
     * |        |          |001 = UART1 TX
     * |        |          |011 = SPI2 SCLK
     * |        |          |100 = SmartCard1 DATA
     * |        |          |101 = ADC input channel9
     * |        |          |Others = GPIOD[1]
     * |[10:8]  |PD2_MFP   |PD.2 Pin Function Selection
     * |        |          |001 = UART1 RTSn
     * |        |          |010 = I2S WS
     * |        |          |011 = SPI2 MISO0
     * |        |          |100 = SmartCard1 power
     * |        |          |101 = ADC input channel10
     * |        |          |Others = GPIOD[2]
     * |[14:12] |PD3_MFP   |PD.3 Pin Function Selection
     * |        |          |001 = UART1 CTSn
     * |        |          |010 = I2S BCLK
     * |        |          |011 = SPI2 MOSI0
     * |        |          |100 = SmartCard1 reset
     * |        |          |101 = ADC input channel11
     * |        |          |Others = GPIOD[3]
     * |[18:16] |PD4_MFP   |PD.4 Pin Function Selection
     * |        |          |010 = I2S Din
     * |        |          |011 = SPI2 MISO1
     * |        |          |100 = SmartCard1 card detection
     * |        |          |111 = LCD SEG 35
     * |        |          |Others = GPIOD[4]
     * |[22:20] |PD5_MFP   |PD.5 Pin Function Selection
     * |        |          |010 = I2S Dout
     * |        |          |011 = SPI2 MOSI1
     * |        |          |111 = LCD SEG 34
     * |        |          |Others = GPIOD[5]
     * |[26:24] |PD6_MFP   |PD.6 Pin Function Selection
     * |        |          |111 = LCD SEG 3
     * |        |          |Others = GPIOD[6]
     * |[30:28] |PD7_MFP   |PD.7 Pin Function Selection
     * |        |          |111 = LCD SEG 2
     * |        |          |Others = GPIOD[7]
    */
    __IO uint32_t PD_L_MFP;

    /**
     * PD_H_MFP
     * ===================================================================================================
     * Offset: 0x4C  Port D high byte multiple function control register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PD8_MFP   |PD.8 Pin Function Selection
     * |        |          |111 = LCD SEG 19
     * |        |          |Others = GPIOD[8]
     * |[6:4]   |PD9_MFP   |PD.9 Pin Function Selection
     * |        |          |111 = LCD SEG 18
     * |        |          |Others = GPIOD[9]
     * |[10:8]  |PD10_MFP  |PD.10 Pin Function Selection
     * |        |          |111 = LCD SEG 17
     * |        |          |Others = GPIOD[10]
     * |[14:12] |PD11_MFP  |PD.11 Pin Function Selection
     * |        |          |111 = LCD SEG 16
     * |        |          |Others = GPIOD[11]
     * |[18:16] |PD12_MFP  |PD.12 Pin Function Selection
     * |        |          |111 = LCD SEG 15
     * |        |          |Others = GPIOD[12]
     * |[22:20] |PD13_MFP  |PD.13 Pin Function Selection
     * |        |          |111 = LCD SEG 14
     * |        |          |Others = GPIOD[13]
     * |[26:24] |PD14_MFP  |PD.14 Pin Function Selection
     * |        |          |111 = LCD SEG 1
     * |        |          |Others = GPIOD[14]
     * |[30:28] |PD15_MFP  |PD.15 Pin Function Selection
     * |        |          |111 = LCD SEG 0
     * |        |          |Others = GPIOD[15]
    */
    __IO uint32_t PD_H_MFP;

    /**
     * PE_L_MFP
     * ===================================================================================================
     * Offset: 0x50  Port E low byte multiple function control register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PE0_MFP   |PE.0 Pin Function Selection
     * |        |          |001 = PWM1 Channel 2
     * |        |          |010 = I2S MCLK
     * |        |          |Others = GPIOE[0]
     * |[6:4]   |PE1_MFP   |PE.1 Pin Function Selection
     * |        |          |001 = PWM1 Channel 3
     * |        |          |110 = SPI0 1st slave select pin
     * |        |          |Others = GPIOE[1]
     * |[10:8]  |PE2_MFP   |PE.2 Pin Function Selection
     * |        |          |110 = SPI0 SCLK
     * |        |          |Others = GPIOE[2]
     * |[14:12] |PE3_MFP   |PE.3 Pin Function Selection
     * |        |          |110 = SPI0 MISO0
     * |        |          |Others = GPIOE[3]
     * |[18:16] |PE4_MFP   |PE.4 Pin Function Selection
     * |        |          |110 = SPI0 MOSI0
     * |        |          |Others = GPIOE[4]
     * |[22:20] |PE5_MFP   |PE.5 Pin Function Selection
     * |        |          |001 = PWM1 Channel 1
     * |        |          |Others = GPIOE[5]
     * |[26:24] |PE6_MFP   |PE.6 Pin Function Selection
     * |        |          |GPIOE[6]
     * |[30:28] |PE7_MFP   |PE.7 Pin Function Selection
     * |        |          |111 = LCD SEG 8
     * |        |          |Others = GPIOE[7]
    */
    __IO uint32_t PE_L_MFP;

    /**
     * PE_H_MFP
     * ===================================================================================================
     * Offset: 0x54  Port E high byte multiple function control register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PE8_MFP   |PE.8 Pin Function Selection
     * |        |          |111 = LCD SEG 9
     * |        |          |Others = GPIOE[8]
     * |[6:4]   |PE9_MFP   |PE.9 Pin Function Selection
     * |        |          |111 = UART1 RX
     * |        |          |Others = GPIOE[9]
     * |[10:8]  |PE10_MFP  |PE.10 Pin Function Selection
     * |        |          |111 = UART1 TX
     * |        |          |Others = GPIOE[10]
     * |[14:12] |PE11_MFP  |PE.11 Pin Function Selection
     * |        |          |111 = UART1 RTSn
     * |        |          |Others = GPIOE[11]
     * |[18:16] |PE12_MFP  |PE.12 Pin Function Selection
     * |        |          |111 = UART1 CTSn
     * |        |          |Others = GPIOE[12]
     * |[22:20] |PE13_MFP  |PE.13 Pin Function Selection
     * |        |          |111 = LCD SEG 27
     * |        |          |Others = GPIOE[13]
     * |[26:24] |PE14_MFP  |PE.14 Pin Function Selection
     * |        |          |111 = LCD SEG 28
     * |        |          |Others = GPIOE[14]
     * |[30:28] |PE15_MFP  |PE.15 Pin Function Selection
     * |        |          |111 = LCD SEG 2
     * |        |          |Others = GPIOE[15]
    */
    __IO uint32_t PE_H_MFP;

    /**
     * PF_L_MFP
     * ===================================================================================================
     * Offset: 0x58  Port F low byte multiple function control register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PF0_MFP   |PF.0 Pin Function Selection
     * |        |          |101 = External interrupt 0
     * |        |          |111 = ICE DATA
     * |        |          |Others = GPIOF[1]
     * |[6:4]   |PF1_MFP   |PF.1 Pin Function Selection
     * |        |          |100 = FRQDIV_CLK
     * |        |          |101 = External interrupt 1
     * |        |          |111 = ICE CLOCK
     * |        |          |Others = GPIOF[1]
     * |[10:8]  |PF2_MFP   |PF.2 Pin Function Selection
     * |        |          |111 = HXT OUT
     * |        |          |Others = GPIOF[2]
     * |[14:12] |PF3_MFP   |PF.3 Pin Function Selection
     * |        |          |111 = HXT IN
     * |        |          |Others = GPIOF[3]
     * |[18:16] |PF4_MFP   |PF.4 Pin Function Selection
     * |        |          |001 = I2C0 SDA
     * |        |          |Others = GPIOF[4]
     * |[22:20] |PF5_MFP   |PF.5 Pin Function Selection
     * |        |          |001 = I2C0 SCL
     * |        |          |Others = GPIOF[5]
    */
    __IO uint32_t PF_L_MFP;
    uint32_t RESERVE2[1];


    /**
     * PORCTL
     * ===================================================================================================
     * Offset: 0x60  Power-On-Reset Controller Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |POR_DIS_CODE|Power-On Reset Enable Control
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |When powered on, the POR circuit generates a reset signal to reset the whole chip function, but noise on the power may cause the POR active again.
     * |        |          |If setting the POR_DIS_CODE to 0x5AA5, the POR reset function will be disabled and the POR function will be active again when POR_DIS_CODE is set to another value or POR_DIS_CODE is reset by chip other reset functions, including: /RESET, Watchdog Timer reset, BOD reset, ICE reset command and the software-chip reset function.
    */
    __IO uint32_t PORCTL;

    /**
     * BODCTL
     * ===================================================================================================
     * Offset: 0x64  Brown-out Detector Controller Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BOD17_EN  |Brown-Out Detector 1.7V Function Enable
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |The default value is set by flash controller user configuration register config0 bit[20:19]
     * |        |          |Users can disable BOD17_EN but it takes effective (disabled) only in Power-down mode.
     * |        |          |Once existing Power-down mode, BOD17 will be enabled by HW automatically.
     * |        |          |When CPU reads this bit, CPU will read whether BOD17 function enabled or not.
     * |        |          |In other words,CPU will always read high.
     * |        |          |0 = Brown-out Detector 1.7V function Disabled.
     * |        |          |1 = Brown-out Detector 1.7V function Enabled.
     * |[1]     |BOD20_EN  |Brown-Out Detector 2.0 V Function Enable
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |0 = Brown-out Detector 2.0 V function Disabled.
     * |        |          |1 = Brown-out Detector 2.0 V function Enabled.
     * |        |          |BOD20_EN is default on.
     * |        |          |If SW disables it, Brown-out Detector 2.0 V function is not disabled until chip enters power-down mode.
     * |        |          |If system is not in power-down mode, BOD20_EN will be enabled by hardware automatically.
     * |[2]     |BOD25_EN  |Brown-Out Detector 2.5 V Function Enable
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |0 = Brown-out Detector 2.5 V function Disabled.
     * |        |          |1 = Brown-out Detector 2.5 V function Enabled.
     * |[4]     |BOD17_RST_EN|BOD 1.7 V Reset Enable
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |0 = Reset does not issue when BOD17 occurs.
     * |        |          |1 = Reset issues when BOD17 occurs.
     * |        |          |The default value is set by flash controller user configuration register config0 bit[20:19]
     * |        |          |BOD17_RST_EN can be controlled (enable or disable) only when BOD17_EN is high.
     * |[5]     |BOD20_RST_EN|BOD 2.0 V Reset Enable
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |0 = Reset does not issue when BOD20 occurs.
     * |        |          |1 = Reset issues when BOD20 occurs.
     * |        |          |The default value is set by flash controller user configuration register config0 bit[20:19]
     * |[6]     |BOD25_RST_EN|BOD 2.5 V Reset Enable
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |0 = Reset does not issue when BOD25 occurs.
     * |        |          |1 = Reset issues when BOD25 occurs.
     * |        |          |The default value is set by flash controller user configuration register config0 bit[20:19]
     * |[8]     |BOD17_INT_EN|BOD 1.7 V Interrupt Enable
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |0 = Interrupt does not issue when BOD17 occurs.
     * |        |          |1 = Interrupt issues when BOD17 occurs.
     * |[9]     |BOD20_INT_EN|BOD 2.0 V Interrupt Enable
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |0 = Interrupt does not issue when BOD20 occurs.
     * |        |          |1 = Interrupt issues when BOD20 occurs.
     * |[10]    |BOD25_INT_EN|BOD 2.5 V Interrupt Enable
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |0 = Interrupt does not issue when BOD25 occurs.
     * |        |          |1 = Interrupt issues when BOD25 occurs.
    */
    __IO uint32_t BODCTL;

