MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NANO100SE3BN/mcu.h
/*---------------------- Interrupt Controller -------------------------*/
/**
    @addtogroup INT Interrupt Controller (INTR)
    Memory Mapped Structure for INT Controller
@{ */

typedef struct
{


    /**
     * IRQ0SRC ~ IRQ31SRC
     * ===================================================================================================
     * Offset: 0x00 ~0x7C IRQ0~IRQ31 Interrupt Source Identity
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |INT_SRC   |Interrupt Source
     * |        |          |Define the interrupt sources for interrupt event.
    */
    __I  uint32_t IRQSRC[32];


    /**
     * NMI_SEL
     * ===================================================================================================
     * Offset: 0x80  NMI Source Interrupt Select Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:0]   |NMI_SEL   |The NMI interrupt to Cortex-M0 can be selected from one of the interrupt[31:0]
     * |        |          |The NMI_SEL bit[4:0] used to select the NMI interrupt source
    */
    __IO uint32_t NMI_SEL;

    /**
     * MCU_IRQ
     * ===================================================================================================
     * Offset: 0x84  MCU IRQ Number Identity Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |MCU_IRQ   |MCU IRQ Source Register
     * |        |          |The IRQ collects all the interrupts from the peripherals and generates the synchronous interrupt to Cortex-M0 core.
     * |        |          |There are two modes to generate interrupt to Cortex-M0 - the normal mode and test mode.
     * |        |          |In Normal mode (control by NMI_SEL register bit [7] = 0) The MCU_IRQ collects all interrupts from each peripheral
     * |        |          |and synchronizes  them and then interrupts  the Cortex-M0.
     * |        |          |In Test mode, all the interrupts from peripheral are blocked, and the interrupts sent to
     * |        |          |MCU are replaced by set the bit31~bit0.
     * |        |          |When the IRQ[n] is 0, setting IRQ[n] to 1 will generate an interrupt to Cortex-M0 NVIC[n].
     * |        |          |When the IRQ[n] is 1 (mean an interrupt is assert), setting 1 to the MCU_bit[n] will clear the interrupt and setting IRQ[n] 0 has no effect.
    */
    __IO uint32_t MCU_IRQ;

} INTR_T;

/**
    @addtogroup INT_CONST INT Bit Field Definition
    Constant Definitions for INT Controller
@{ */

#define INTR_IRQSRC_INT_SRC_Pos           (0)                                               /*!< INTR_T::IRQSRC: INT_SRC Position           */
#define INTR_IRQSRC_INT_SRC_Msk           (0xful << INTR_IRQ0SRC_INT_SRC_Pos)               /*!< INTR_T::IRQSRC: INT_SRC Mask               */

#define INTR_NMI_SEL_NMISEL_Pos           (0)                                               /*!< INTR_T::NMI_SEL: NMISEL Position           */
#define INTR_NMI_SEL_NMISEL_Msk           (0x1ful << INTR_NMI_SEL_NMISEL_Pos)               /*!< INTR_T::NMI_SEL: NMISEL Mask               */

#define INTR_MCU_IRQ_MCU_IRQ_Pos          (0)                                               /*!< INTR_T::MCU_IRQ: MCU_IRQ Position          */
#define INTR_MCU_IRQ_MCU_IRQ_Msk          (0xfffffffful << INTR_MCU_IRQ_MCU_IRQ_Pos)        /*!< INTR_T::MCU_IRQ: MCU_IRQ Mask              */

/**@}*/ /* INTR_CONST */
/**@}*/ /* end of INTR register group */


/*---------------------- LCD Controller -------------------------*/
/**
    @addtogroup LCD LCD Controller(LCD)
    Memory Mapped Structure for LCD Controller
@{ */

typedef struct
{


    /**
     * CTL
     * ===================================================================================================
     * Offset: 0x00  LCD Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EN        |LCD Enable
     * |        |          |0 = LCD controller operation Disabled.
     * |        |          |1 = LCD controller operation Enabled.
     * |[3:1]   |MUX       |Mux Select
     * |        |          |000 = Static.
     * |        |          |001 = 1/2 duty.
     * |        |          |010 = 1/3 duty.
     * |        |          |011 = 1/4 duty.
     * |        |          |100 = 1/5 duty.
     * |        |          |101 = 1/6 duty.
     * |        |          |110 = Reserved.
     * |        |          |111 = Reserved.
     * |        |          |Note : User does not need to set PD_H_MFP bit field, but only to set the MUX bit field to switch LCD_SEG0 and LCD_SEG1 to LCD_COM4 and LCD_COM5 for Nano110 and Nano130 series.
     * |[6:4]   |FREQ      |LCD Frequency Selection
     * |        |          |000 = LCDCLK Divided by 32.
     * |        |          |001 = LCDCLK Divided by 64.
     * |        |          |010 = LCDCLK Divided by 96.
     * |        |          |011 = LCDCLK Divided by 128.
     * |        |          |100 = LCDCLK Divided by 192.
     * |        |          |101 = LCDCLK Divided by 256.
     * |        |          |110 = LCDCLK Divided by 384.
     * |        |          |111 = LCDCLK Divided by 512.
     * |[7]     |BLINK     |LCD Blinking Enable
     * |        |          |0 = Blinking Disabled.
     * |        |          |1 = Blinking Enabled.
     * |[8]     |PDDISP_EN |Power Down Display Enable
     * |        |          |The LCD can be programmed to be displayed or not be displayed at power down state by PDDISP_EN setting.
     * |        |          |0 = LCD display Disabled ( LCD is put out) at power down state.
     * |        |          |1 = LCD display Enabled (LCD keeps the display) at power down state.
     * |[9]     |PDINT_EN  |Power Down Interrupt Enable
     * |        |          |If the power down request is triggered from system management, LCD controller will execute the frame completely to avoid the DC component.
     * |        |          |When the frame is executed completely, the LCD power down interrupt signal is generated to inform system management that LCD controller is ready to enter power down state, if PDINT_EN is set to 1.
     * |        |          |Otherwise, if PDINT_EN is set to 0, the LCD power down interrupt signal is blocked and the interrupt is disabled to send to system management.
     * |        |          |0 = Power Down Interrupt Disabled.
     * |        |          |1 = Power Down Interrupt Enabled.
    */
    __IO uint32_t CTL;

    /**
     * DISPCTL
     * ===================================================================================================
     * Offset: 0x04  LCD Display Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CPUMP_EN  |Charge Pump Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[2:1]   |BIAS_SEL  |Bias Selection
     * |        |          |00 = Static.
     * |        |          |01 = 1/2 Bias.
     * |        |          |10 = 1/3 Bias.
     * |        |          |11 = Reserved.
     * |[4]     |IBRL_EN   |Internal Bias Reference Ladder Enable
     * |        |          |0 = Bias reference ladder Disabled.
     * |        |          |1 = Bias reference ladder Enabled.
     * |[6]     |BV_SEL    |Bias Voltage Type Selection
     * |        |          |0 = C-Type bias mode. Bias voltage source from internal bias generator.
     * |        |          |1 = R-Type bias mode. Bias voltage source from external bias generator.
     * |        |          |Note: The external resistor ladder should be connected to the V1 pin, V2 pin, V3 pin and VSS.
     * |        |          |The VLCD pin should also be connected to VDD.
     * |[10:8]  |CPUMP_VOL_SET|Charge Pump Voltage Selection
     * |        |          |000 = 2.7V.
     * |        |          |001 = 2.8V.
     * |        |          |010 = 2.9V.
     * |        |          |011 = 3.0V.
     * |        |          |100 = 3.1V.
     * |        |          |101 = 3.2V.
     * |        |          |110 = 3.3V.
     * |        |          |111 = 3.4V.
     * |[13:11] |CPUMP_FREQ|Charge Pump Frequency Selection
     * |        |          |000 = LCDCLK.
     * |        |          |001 = LCDCLK/2.
     * |        |          |010 = LCDCLK/4.
     * |        |          |011 = LCDCLK/8.
     * |        |          |100 = LCDCLK/16.
     * |        |          |101 = LCDCLK/32.
     * |        |          |110 = LCDCLK/64.
     * |        |          |111 = LCDCLK/128.
    */
    __IO uint32_t DISPCTL;

    /**
     * MEM_0
     * ===================================================================================================
     * Offset: 0x08  LCD SEG3 ~ SEG0 data
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |SEG_0_4x  |SEG_0_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[14:8]  |SEG_1_4x  |SEG_1_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[21:16] |SEG_2_4x  |SEG_2_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[29:24] |SEG_3_4x  |SEG_3_4x DATA for COM (x = 0 ~ 9)
     * |        |          |LCD display data
    */
    __IO uint32_t MEM_0;

    /**
     * MEM_1
     * ===================================================================================================
     * Offset: 0x0C  LCD SEG7 ~ SEG4 data
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |SEG_0_4x  |SEG_0_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[14:8]  |SEG_1_4x  |SEG_1_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[21:16] |SEG_2_4x  |SEG_2_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[29:24] |SEG_3_4x  |SEG_3_4x DATA for COM (x = 0 ~ 9)
     * |        |          |LCD display data
    */
    __IO uint32_t MEM_1;

    /**
     * MEM_2
     * ===================================================================================================
     * Offset: 0x10  LCD SEG11 ~ SEG8 data
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |SEG_0_4x  |SEG_0_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[14:8]  |SEG_1_4x  |SEG_1_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[21:16] |SEG_2_4x  |SEG_2_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[29:24] |SEG_3_4x  |SEG_3_4x DATA for COM (x = 0 ~ 9)
     * |        |          |LCD display data
    */
    __IO uint32_t MEM_2;

    /**
     * MEM_3
     * ===================================================================================================
     * Offset: 0x14  LCD SEG15 ~ SEG12 data
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |SEG_0_4x  |SEG_0_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[14:8]  |SEG_1_4x  |SEG_1_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[21:16] |SEG_2_4x  |SEG_2_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[29:24] |SEG_3_4x  |SEG_3_4x DATA for COM (x = 0 ~ 9)
     * |        |          |LCD display data
    */
    __IO uint32_t MEM_3;

    /**
     * MEM_4
     * ===================================================================================================
     * Offset: 0x18  LCD SEG19 ~ SEG16 data
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |SEG_0_4x  |SEG_0_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[14:8]  |SEG_1_4x  |SEG_1_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[21:16] |SEG_2_4x  |SEG_2_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[29:24] |SEG_3_4x  |SEG_3_4x DATA for COM (x = 0 ~ 9)
     * |        |          |LCD display data
    */
    __IO uint32_t MEM_4;

    /**
     * MEM_5
     * ===================================================================================================
     * Offset: 0x1C  LCD SEG23 ~ SEG20 data
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |SEG_0_4x  |SEG_0_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[14:8]  |SEG_1_4x  |SEG_1_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[21:16] |SEG_2_4x  |SEG_2_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[29:24] |SEG_3_4x  |SEG_3_4x DATA for COM (x = 0 ~ 9)
     * |        |          |LCD display data
    */
    __IO uint32_t MEM_5;

    /**
     * MEM_6
     * ===================================================================================================
     * Offset: 0x20  LCD SEG27 ~ SEG24 data
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |SEG_0_4x  |SEG_0_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[14:8]  |SEG_1_4x  |SEG_1_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[21:16] |SEG_2_4x  |SEG_2_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[29:24] |SEG_3_4x  |SEG_3_4x DATA for COM (x = 0 ~ 9)
     * |        |          |LCD display data
    */
    __IO uint32_t MEM_6;

    /**
     * MEM_7
     * ===================================================================================================
     * Offset: 0x24  LCD SEG31 ~ SEG28 data
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |SEG_0_4x  |SEG_0_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[14:8]  |SEG_1_4x  |SEG_1_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[21:16] |SEG_2_4x  |SEG_2_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[29:24] |SEG_3_4x  |SEG_3_4x DATA for COM (x = 0 ~ 9)
     * |        |          |LCD display data
    */
    __IO uint32_t MEM_7;

    /**
     * MEM_8
     * ===================================================================================================
     * Offset: 0x28  LCD SEG35 ~ SEG32 data
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |SEG_0_4x  |SEG_0_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[14:8]  |SEG_1_4x  |SEG_1_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[21:16] |SEG_2_4x  |SEG_2_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[29:24] |SEG_3_4x  |SEG_3_4x DATA for COM (x = 0 ~ 9)
     * |        |          |LCD display data
    */
    __IO uint32_t MEM_8;

    /**
     * MEM_9
     * ===================================================================================================
     * Offset: 0x2C  LCD SEG39 ~ SEG36 data
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |SEG_0_4x  |SEG_0_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[14:8]  |SEG_1_4x  |SEG_1_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[21:16] |SEG_2_4x  |SEG_2_4x DATA for COM(x= 0 ~ 9)
     * |        |          |LCD display data
     * |[29:24] |SEG_3_4x  |SEG_3_4x DATA for COM (x = 0 ~ 9)
     * |        |          |LCD display data
    */
    __IO uint32_t MEM_9;

    /**
     * FCR
     * ===================================================================================================
     * Offset: 0x30  LCD frame counter control register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |FCEN      |LCD Frame Counter Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[1]     |FCINTEN   |LCD Frame Counter Interrupt Enable
     * |        |          |0 = Frame counter interrupt Disabled.
     * |        |          |1 = Frame counter interrupt Enabled.
     * |[3:2]   |PRESCL    |Frame Counter Pre-Scaler Value
     * |        |          |00 = CLKframe/1.
     * |        |          |01 = CLKframe/2.
     * |        |          |10 = CLKframe/4.
     * |        |          |11 = CLKframe/8.
     * |[9:4]   |FCV       |Frame Counter Top Value
     * |        |          |These 6 bits contain the top value of the Frame counter.
    */
    __IO uint32_t FCR;

    /**
     * FCSTS
     * ===================================================================================================
     * Offset: 0x34  LCD frame counter status
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |FCSTS     |LCD Frame Counter Status
     * |        |          |0 = Frame counter value does not reach FCV (Frame Count TOP value).
     * |        |          |1 = Frame counter value reaches FCV (Frame Count TOP value).
     * |        |          |If the FCINTEN is s enabled, the frame counter overflow Interrupt is generated.
     * |[1]     |PDSTS     |Power-Down Interrupt Status
     * |        |          |0 = Inform system manager that LCD controller is not ready to enter power-down state until this bit becomes 1 if power down is set and one frame is not executed completely.
     * |        |          |1 = Inform system manager that LCD controller is ready to enter power-down state if power down is set and one frame is executed completely
    */
    __IO uint32_t FCSTS;

} LCD_T;

/**
    @addtogroup LCD_CONST LCD Bit Field Definition
    Constant Definitions for LCD Controller
@{ */

